In [2]:
import numpy as np
import pandas as pd

**문제1 : 학생들의 중간, 기말 고사 성적만으로 '총점'과 '평점' 추가하기**

In [3]:
friend_dict_list = [{'이름': '나학생1', '중간고사점수': 95, '기말고사점수': 85},
         {'이름': '나학생2', '중간고사점수': 85, '기말고사점수': 80},
         {'이름': '나학생3', '중간고사점수': 10, '기말고사점수': 30}]
friend_dict_list

[{'이름': '나학생1', '중간고사점수': 95, '기말고사점수': 85},
 {'이름': '나학생2', '중간고사점수': 85, '기말고사점수': 80},
 {'이름': '나학생3', '중간고사점수': 10, '기말고사점수': 30}]

In [4]:
df = pd.DataFrame(friend_dict_list)
df

     이름  중간고사점수  기말고사점수
0  나학생1      95      85
1  나학생2      85      80
2  나학생3      10      30

In [6]:
df['중간고사점수'] + 10

0    105
1     95
2     20
Name: 중간고사점수, dtype: int64

In [7]:
df['중간고사점수'] + df['기말고사점수']

0    180
1    165
2     40
dtype: int64

In [8]:
df['총점'] = df['중간고사점수'] + df['기말고사점수']
df

     이름  중간고사점수  기말고사점수   총점
0  나학생1      95      85  180
1  나학생2      85      80  165
2  나학생3      10      30   40

In [10]:
df['평균'] = df['총점']/2
df

     이름  중간고사점수  기말고사점수   총점    평균
0  나학생1      95      85  180  90.0
1  나학생2      85      80  165  82.5
2  나학생3      10      30   40  20.0

In [13]:
# 단순 컬럼명만 반복해서 출력
for name in df:
    print(name)

이름
중간고사점수
기말고사점수
총점
평균

In [16]:
df

     이름  중간고사점수  기말고사점수   총점    평균
0  나학생1      95      85  180  90.0
1  나학생2      85      80  165  82.5
2  나학생3      10      30   40  20.0

In [17]:
# DataFrame에 row별 반환 해서 활용
for key, value in df.iterrows():
    print(key, '-----', value)
    print('*' * 20)

0 ----- 이름        나학생1
중간고사점수      95
기말고사점수      85
총점         180
평균          90
Name: 0, dtype: object
********************
1 ----- 이름        나학생2
중간고사점수      85
기말고사점수      80
총점         165
평균        82.5
Name: 1, dtype: object
********************
2 ----- 이름        나학생3
중간고사점수      10
기말고사점수      30
총점          40
평균          20
Name: 2, dtype: object
********************

In [18]:
df

     이름  중간고사점수  기말고사점수   총점    평균
0  나학생1      95      85  180  90.0
1  나학생2      85      80  165  82.5
2  나학생3      10      30   40  20.0

In [19]:
df['총점']

0    180
1    165
2     40
Name: 총점, dtype: int64

In [20]:
df.총점

0    180
1    165
2     40
Name: 총점, dtype: int64

**문제2 : DataFrame도 반복문으로 처리 가능 평균값을 반복문(for) 활용해서 출력해 보기**

In [22]:
for avg in df['평균']:
    print(avg)

90.0
82.5
20.0

In [23]:
df

     이름  중간고사점수  기말고사점수   총점    평균
0  나학생1      95      85  180  90.0
1  나학생2      85      80  165  82.5
2  나학생3      10      30   40  20.0

In [24]:
df['평균'] >= 90

0     True
1    False
2    False
Name: 평균, dtype: bool

**문제3 : grade(등급) 이라는 컬럼 추가, 90점이상(A), 80점이상(B), 그외 F등급 조건식 활용해서 파이썬 코드로 처리해 보기**

blank list 생성 -> 반복문에서 평균값 하나씩 반환 -> 값 비교 -> 등급 적용 -> list append -> 출력 
-> DataFram에 추가

In [26]:
df

     이름  중간고사점수  기말고사점수   총점    평균
0  나학생1      95      85  180  90.0
1  나학생2      85      80  165  82.5
2  나학생3      10      30   40  20.0

In [25]:
grade = []

for avg in df['평균']:
    if avg >= 90:
        grade.append('A')
    elif avg >= 80:
        grade.append('B')
    else:
        grade.append('F')
print(grade)

['A', 'B', 'F']

In [28]:
df['grade'] = grade
df

     이름  중간고사점수  기말고사점수   총점    평균 grade
0  나학생1      95      85  180  90.0     A
1  나학생2      85      80  165  82.5     B
2  나학생3      10      30   40  20.0     F

**문제4:'이수여부'라는 컬럼을 추가하되 등급을 기준으로 F인 경우 fail/F가 아닌 경우 pass 값으로 반영 단 lambda 문법으로 처리해 보기**

In [ ]:
if 조건식:
    pass
else:
    False인 경우 실행

In [30]:
df['grade']

0    A
1    B
2    F
Name: grade, dtype: object

In [29]:
# apply() : 함수 호출 및 람다식적용시  사용하는 표현
# 조건식 적용시 if 조건식이 true인 경우 처리 로직은(반환값) if 키워드 앞단에 명시

df['이수여부'] = df['grade'].apply(lambda v : 'pass' if v != 'F' else 'fail')
df

     이름  중간고사점수  기말고사점수   총점    평균 grade  이수여부
0  나학생1      95      85  180  90.0     A  pass
1  나학생2      85      80  165  82.5     B  pass
2  나학생3      10      30   40  20.0     F  fail

**문제5: apply 함수를 사용해서 년월일 정보에서 년에 해당하는 정보만 반환**

apply() 특징

1. <font color='red'>pandas.core.series.Series 제공하는 함수</font><br>
2. 람다식 적용
3. 사용자 정의 함수도 적용
4. 함수명이 parameter로 반영 또는 데이터값(단, 호출하는 하는 함수의 parameter로 데이터값이 적용 가능)
추가로 적용 가능
5. 호출 횟수는 Serise가 보유한 row수 데이터 수 만큼 자동 호출
6. 내부 로직 : 반복 로직 포함

In [31]:
date_list = [{'yyyy-mm-dd': '2000-06-27'},
         {'yyyy-mm-dd': '2002-09-24'},
         {'yyyy-mm-dd': '2018-12-20'}]

df = pd.DataFrame(date_list)
df

   yyyy-mm-dd
0  2000-06-27
1  2002-09-24
2  2018-12-20

In [32]:
df['yyyy-mm-dd']

0    2000-06-27
1    2002-09-24
2    2018-12-20
Name: yyyy-mm-dd, dtype: object

In [34]:
v = '2000-06-27'.split('-')  # list로 반환
print(v[0])

2000

In [36]:
for v in df['yyyy-mm-dd']:
    #print(v)
    #print(v.split('-')[0])
    print(v[0:4])

2000
2002
2018

In [37]:
# 사용자 정의 함수 개발, 유입받은 변수값(parameter)를 slice해서 년도값만 반환 
def getYear(row):
    return row[0:4]

print(getYear('2018-12-30'))

2018

In [38]:
print(type(df))
print(type(df['yyyy-mm-dd']))

<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.series.Series'>

In [40]:
df['yyyy-mm-dd']

0    2000-06-27
1    2002-09-24
2    2018-12-20
Name: yyyy-mm-dd, dtype: object

In [39]:
df['yyyy-mm-dd'].apply(getYear)  # 추상화

0    2000
1    2002
2    2018
Name: yyyy-mm-dd, dtype: object

In [41]:
df

   yyyy-mm-dd
0  2000-06-27
1  2002-09-24
2  2018-12-20

In [43]:
# apply()로 사용자 정의 함수 활용 방법
df['year'] = df['yyyy-mm-dd'].apply(getYear)
df

   yyyy-mm-dd  year
0  2000-06-27  2000
1  2002-09-24  2002
2  2018-12-20  2018

In [46]:
# 2020년 기준으로 나이값을 연산해서 Series 추가
def getAge(year, curr_year):
    return curr_year - int(year)

df['age'] = df['year'].apply(getAge, curr_year=2020)
df

   yyyy-mm-dd  year  age
0  2000-06-27  2000   20
1  2002-09-24  2002   18
2  2018-12-20  2018    2

**문제 6 : gender별로 그룹화 하기**

In [48]:
student_list = [{'name': 'John', 'major': "Computer Science", 'gender': "male"},
                {'name': 'Nate', 'major': "Computer Science", 'gender': "male"},
                {'name': 'Abraham', 'major': "Physics", 'gender': "male"},
                {'name': 'Brian', 'major': "Psychology", 'gender': "male"},
                {'name': 'Janny', 'major': "Economics", 'gender': "female"},
                {'name': 'Yuna', 'major': "Economics", 'gender': "female"},
                {'name': 'Jeniffer', 'major': "Computer Science", 'gender': "female"},
                {'name': 'Edward', 'major': "Computer Science", 'gender': "male"},
                {'name': 'Zara', 'major': "Psychology", 'gender': "female"},
                {'name': 'Wendy', 'major': "Economics", 'gender': "female"},
                {'name': 'Sera', 'major': "Psychology", 'gender': "female"}
         ]
df = pd.DataFrame(student_list, columns = ['name', 'major', 'gender'])
df

        name             major  gender
0       John  Computer Science    male
1       Nate  Computer Science    male
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female

In [49]:
groupby_gender = df.groupby('gender')
groupby_gender

In [50]:
print(groupby_gender.size())

gender
female    6
male      5
dtype: int64

In [52]:
df.gender

0       male
1       male
2       male
3       male
4     female
5     female
6     female
7       male
8     female
9     female
10    female
Name: gender, dtype: object

In [51]:
# 그룹핑된 데이터들이 어떤 index에 있는지 확인 가능 
groupby_gender.groups

{'female': [4, 5, 6, 8, 9, 10], 'male': [0, 1, 2, 3, 7]}

In [53]:
df

        name             major  gender
0       John  Computer Science    male
1       Nate  Computer Science    male
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female

In [54]:
# major
groupby_major = df.groupby('major')
groupby_major.groups

{'Computer Science': [0, 1, 6, 7], 'Economics': [4, 5, 9], 'Physics': [2], 'Psychology': [3, 8, 10]}

In [55]:
# DataFrameGroupBy  객체를 참조하는 변수의 반복문 사용법
# key = 그룹핑된 기준 데이터 / value = 해당 그룹에 포함된 value값들 
for key, value in groupby_major:
    print(key, ' - ', value)
    print('=' * 20)

Computer Science  -         name             major  gender
0      John  Computer Science    male
1      Nate  Computer Science    male
6  Jeniffer  Computer Science  female
7    Edward  Computer Science    male
====================
Economics  -      name      major  gender
4  Janny  Economics  female
5   Yuna  Economics  female
9  Wendy  Economics  female
====================
Physics  -        name    major gender
2  Abraham  Physics   male
====================
Psychology  -       name       major  gender
3   Brian  Psychology    male
8    Zara  Psychology  female
10   Sera  Psychology  female
====================

In [57]:
# 개수 확인 : len(value)
for key, value  in groupby_major:
    print(key, ' - ', len(value))

Computer Science  -  4
Economics  -  3
Physics  -  1
Psychology  -  3

In [59]:
v = groupby_major.size()
print(v)

major
Computer Science    4
Economics           3
Physics             1
Psychology          3
dtype: int64

In [61]:
type(groupby_major.size())

pandas.core.series.Series

In [60]:
# ? 새로운 DataFrame 생성
df2 = pd.DataFrame(groupby_major.size())
df2

                  0
major
Computer Science  4
Economics         3
Physics           1
Psychology        3

In [62]:
# count 라는 컬럼명 적용
# dict 타입의 key:value 구조의 key는 header명으로 사용 
df2 = pd.DataFrame({'count' : groupby_major.size()})
df2

                  count
major
Computer Science      4
Economics             3
Physics               1
Psychology            3

In [63]:
# index를 major값이 아닌 숫자 형식으로 적용
# reset_index() : 매우 중요
df2 = pd.DataFrame({'count' : groupby_major.size()}).reset_index()
df2

              major  count
0  Computer Science      4
1         Economics      3
2           Physics      1
3        Psychology      3

In [73]:
# ? 성별을 기준으로 새로운 DataFrame 생성하시고 index 재정렬 
# 결과치는 성별과 개수 즉 컬럼값, index도 새롭게 적용해 주세요

In [64]:
df

        name             major  gender
0       John  Computer Science    male
1       Nate  Computer Science    male
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female

In [69]:
dfg = pd.DataFrame({'count' : df.groupby('gender').size() }).reset_index()
dfg

   gender  count
0  female      6
1    male      5